# --------------------------------------------------
# 给定一个文本文件 line.txt，请只打印这个文件中的第十行。
# 示例:
# 假设 line.txt 有如下内容：
#   Line 1
#   Line 2
#   Line 3
#   Line 4
#   Line 5
#   Line 6
#   Line 7
#   Line 8
#   Line 9
#   Line 10

# --------------------------------------------------
# 你的脚本应当显示第十行：
#   Line 10

# --------------------------------------------------
# 说明:
#   1. 如果文件少于十行，你应当输出什么？
#   2. 至少有三种不同的解法，请尝试尽可能多的方法来解题。

# --------------------------------------------------
# 以下三种方式均可以运行通过：
#   grep -n "" file.txt | grep -w '10' | cut -d: -f2
#   sed -n '10p' file.txt
#   awk '{if(NR==10){print $0}}' file.txt

grep -n "" file.txt | grep -w '10' | cut -d: -f2